const regex = {
  // 手机号
  phone: /^1[3456789]\d{9}$/,

  // 网址
  url: /^(https?|ftp):\/\/([a-zA-Z0-9.-]+(:[a-zA-Z0-9.&%$-]+)*@)*((25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]?)(\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])){3}|([a-zA-Z0-9-]+\.)*[a-zA-Z0-9-]+\.(com|edu|gov|int|mil|net|org|biz|arpa|info|name|pro|aero|coop|museum|[a-zA-Z]{2}))(:[0-9]+)*(\/($|[a-zA-Z0-9.,?'\\+&%$#=~_-]+))*$/,

  // 正整数
  int: /^([1-9][0-9]*)$/,

  // 中文
  chiness: /^[\u4e00-\u9fa5]*$/,

  // 非中文
  notChiness: /^[^\u4e00-\u9fa5]*$/,

  // 英文
  word: /^[A-Za-z]*$/,

  // 15或18位身份证号码
  idNo: /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/,

  // 香港身份证号码
  idNoHonkong: /^((\s?[A-Za-z])|([A-Za-z]{2}))\d{6}(([0−9aA])|([0-9aA]))$/,

  // 密码规则：6-20位字母或数字组合
  password: /^[A-Za-z0-9]{6,20}$/,

  // 邮箱
  email: /^([A-Za-z0-9_\-\.])+\@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$/,

  // 银行账户
  bankAccount: /^([1-9]{1})(\d{14}|\d{18})$/,

  // 过滤 emoji
  emoji: /\uD83C[\uDF00-\uDFFF]|\uD83D[\uDC00-\uDE4F]/g,
}

export default regex
